---
kind: method
id: M:Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ)
source: html/b4c1d4ae-613f-979d-65d8-3c099cca6c3f.htm
---
# Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor Method

Constructs a new instance of a filter to match elements with a bounding box that contains the given point.

## Syntax (C#)
```csharp
public BoundingBoxContainsPointFilter(
	XYZ point
)
```

## Parameters
- **point** (`Autodesk.Revit.DB.XYZ`) - The point used to find elements with a bounding box that contains it.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null